#include <stdio.h>

int main(int argc, char const *argv[])
{
    // arr是一个数组长度为[4]
    // 内部子元素是int [3] 类型
    // { {1,2,3}, {4,5,6}, {7,8,9}, {10,11,12} }
    // 从内存角度来说,连续的内存
    // 但是方便开发者理解, 我们会将其看做是 四行三列
    /*
        {
          {1,2,3},
          {4,5,6},
          {7,8,9},
          {10,11,12}
        }

    */
    // 二维数组完整初始化
    // int arr1[4][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}, {10, 11, 12}};
    //  二维数组初始化长度隐式声明
    // int arr2[][3] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}, {10, 11, 12}};
    // 注意多维数组长度隐式声明只允许省略第一个中括号的长度,其他长度不可省略
    // int arr3[4][] = {{1, 2, 3}, {4, 5, 6}, {7, 8, 9}, {10, 11, 12}};

    // 部分初始化
    int arr4[4][3] = {1, 2, 3, 4};
    // arr4 表示首元素(int [3] 子数组)的地址
    // arr4[0] 表示 *arr4 地址范围缩小一级表示子数组内部首元素(int)的地址
    // arr4[0][0] 表示 **arr4 首子数组中首个子元素int的值
    printf("%d \n", arr4[0][0]);
    printf("%d \n", arr4[0][1]);
    printf("%d \n", arr4[0][2]);
    printf("%d \n", arr4[0][3]);

    printf("%d \n", **(arr4 + 1));
    printf("%d \n", arr4[1][0]);
    printf("%d \n", arr4[1][1]);

    // 我们就知道 二维数组的索引arr[第几行][第几列]

    int arr5[4][3] = {1, 2, 3, 4}; // 初始化部分值,按照连续内存逐一复制
    int arr6[4][3] = {{1}, {2, 77}, {3}, {4}}; // 初始化部分之,内部每个大括号就是int [3]子数组(认为一行)

    printf("%d %d %d %d %d \n", arr5[0][0], arr5[0][1],arr5[0][2], arr5[1][0], arr5[1][1]);   
    
    printf("%d %d %d %d %d \n", arr6[0][0], arr6[1][0],arr6[2][0], arr6[3][0], arr6[1][1]); 
    return 0;
}
